In [2]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

import getpass

In [4]:
password = getpass.getpass()

········

In [5]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

How many distinct (different) actors' last names are there?

In [6]:
data = pd.read_sql_query('SELECT COUNT(DISTINCT(last_name)) FROM actor;', engine)
data.head()

   COUNT(DISTINCT(last_name))
0                         121

Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [26]:
query = '''SELECT *, dayname(rental_date) AS 'day',
CASE
WHEN dayname(rental_date) IN ('Saturday', 'Sunday') THEN 'weekend'
ELSE 'weekday'
END AS 'day_type'
FROM rental
LIMIT 20;'''
data = pd.read_sql_query(query, engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,Tuesday,weekday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,Tuesday,weekday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,Tuesday,weekday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,Tuesday,weekday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,Tuesday,weekday

Get all films with ARMAGEDDON in the title.

In [14]:
query = '''SELECT title FROM film
WHERE title LIKE '%%ARMAGEDDON%%';
'''
data = pd.read_sql_query(query, engine)
data

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

Get 10 the longest films.

In [16]:
query = '''SELECT title FROM film
ORDER BY length DESC
LIMIT 10;'''
data = pd.read_sql_query(query, engine)
data.head(10)

                title
0      DARN FORRESTER
1        POND SEATTLE
2       CHICAGO NORTH
3       MUSCLE BRIGHT
4        WORST BANGER
5         GANGS PRIDE
6  SOLDIERS EVOLUTION
7           HOME PITY
8   SWEET BROTHERHOOD
9      CONTROL ANTHEM

How many films include Behind the Scenes content?

In [8]:
query = '''SELECT COUNT(title) FROM film
WHERE special_features LIKE '%%Behind the scenes%%';'''
data = pd.read_sql_query(query, engine)
data.head(10)

   COUNT(title)
0           538

Which kind of movies (rating) have a mean duration of more than two hours?

In [12]:
query = '''SELECT count(title), rating, round(AVG(length), 2) FROM film
GROUP BY rating HAVING  round(AVG(length), 2) > 120;'''
data = pd.read_sql_query(query, engine)
data.head(10)

   count(title) rating  round(AVG(length), 2)
0           223  PG-13                 120.44

Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [17]:
query = '''SELECT title, length, ROW_NUMBER () OVER (ORDER BY length DESC) length_rank
FROM film
WHERE LENGTH IS NOT NULL AND length <> 0;'''
data = pd.read_sql_query(query, engine)
data.head(10)

                title  length  length_rank
0       CHICAGO NORTH     185            1
1      CONTROL ANTHEM     185            2
2      DARN FORRESTER     185            3
3         GANGS PRIDE     185            4
4           HOME PITY     185            5
5       MUSCLE BRIGHT     185            6
6        POND SEATTLE     185            7
7  SOLDIERS EVOLUTION     185            8
8   SWEET BROTHERHOOD     185            9
9        WORST BANGER     185           10